#pragma once
//=============================================================================
// 弾処理 [bullet.h]
// Author : 新里　将士
//
//=============================================================================

#ifndef __BULLET_H_
#define __BULLET_H_

#include "main.h"






//*****************************************************************************
//プロトタイプ宣言
//*****************************************************************************
void InitBullet();
void DrawBullet(D3DXMATRIX cameraView);
void UpdateBullet();
void UninitBullet();

//*****************************************************************************
//弾構造体
//*****************************************************************************
#define		NUM_BULLET  (100)


void CreateBullet(D3DXVECTOR3 pos, D3DXVECTOR3 speed);


OBJECT3D* GetParentBullet(void);

OBJECT3D* GetBullet();//構造体の先頭ポインタを取得


#endif